---
action: global
title: Usage of Sysinternals Tools 
status: experimental
description: Detects the usage of Sysinternals Tools due to accepteula key beeing added to Registry 
references:
    - https://twitter.com/Moti_B/status/1008587936735035392
date: 2017/08/28
author: PolyLogyx
detection:
    condition: 1 of them
falsepositives:
    - Legitimate use of SysInternals tools
    - Programs that use the same Registry Key
level: low
---
logsource:
    product: win_plgx_extension
detection:
    selection1:
        action: 'REG_SETVALUE'
        target_name: '*\EulaAccepted'
---
logsource:
    category: process_creation
    product: win_plgx_extension
detection:
    selection2:
        cmdline: '* -accepteula*'