title: Suspicious Program Location with Network Connections
status: experimental
description: Detects programs with network connections running in suspicious files system locations
references:
    - https://docs.google.com/spreadsheets/d/17pSTDNpa0sf6pHeRhusvWG6rThciE8CsXTSlDUAZDyo
author: PolyLogyx
date: 2017/03/19
logsource:
    product: win_plgx_extension
    definition: 'Use the following config to generate the necessary Event ID 3 Network Connection events'
detection:
    selection:
        action: 'SOCKET_CONNECT'
        process_name:
            # - '*\ProgramData\\*'  # too many false positives, e.g. with Webex for Windows
            - '*\$Recycle.bin'
            - '*\Users\All Users\\*'
            - '*\Users\Default\\*'
            - '*\Users\Public\\*'
            - 'C:\Perflogs\\*'
            - '*\config\systemprofile\\*'
            - '*\Windows\Fonts\\*'
            - '*\Windows\IME\\*'
            - '*\Windows\addins\\*'
    condition: selection
falsepositives:
    - unknown
level: high
