title: Registry Persistence via Explorer Run Key
status: experimental
description: Detects a possible persistence mechanism using RUN key for Windows Explorer and poiting to a suspicious folder
author: PolyLogyx
date: 2018/07/18
references:
    - https://researchcenter.paloaltonetworks.com/2018/07/unit42-upatre-continues-evolve-new-anti-analysis-techniques/
logsource:
    product: win_plgx_extension
detection:
    selection:
        action: 'REG_SETVALUE'
        target_name: '*\Microsoft\Windows\CurrentVersion\Policies\Explorer\Run'
        value_data:
            - 'C:\Windows\Temp\\*'
            - 'C:\ProgramData\\*'
            - '*\AppData\\*'
            - 'C:\$Recycle.bin\\*'
            - 'C:\Temp\\*'
            - 'C:\Users\Public\\*'
            - 'C:\Users\Default\\*'
    condition: selection
tags:
    - attack.persistence
    - attack.t1060
    - capec.270
falsepositives:
    - Unknown
level: high

