title: RDP over Reverse SSH Tunnel
status: experimental
description: Detects svchost hosting RDP termsvcs communicating with the loopback address and on TCP port 3389
references:
    - https://twitter.com/SBousseaden/status/1096148422984384514
author: PolyLogyx
date: 2019/02/16
tags:
    - attack.defense_evasion
    - attack.command_and_control
    - attack.t1076
logsource:
    product: win_plgx_extension
detection:
    selection:
        action: 'SOCKET_CONNECT'
        process_name: '*\svchost.exe'
        src_port: 3389
        dst_address:
            - '127.*'
            - '::1'
    condition: selection
falsepositives:
    - unknown
level: high