title: Hijack legit RDP session to move laterally  
status: experimental
description: Detects the usage of tsclient share to place a backdoor on the RDP source machine's startup folder
date: 2019/02/21
author: PolyLogyx
logsource:
    product: win_plgx_extension
detection:
    selection:
        action: 'FILE_CREATE'
        process_name: '*\mstsc.exe'
        target_path: '*\Microsoft\Windows\Start Menu\Programs\Startup\*'
    condition: selection
falsepositives:
    - unknown
level: high
