title: Hiding files with attrib.exe
status: experimental
description: Detects usage of attrib.exe to hide files from users.
author: Sami Ruohonen
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        path: '*\attrib.exe'
        cmdline: '* +h *'
    ini:
        cmdline: '*\desktop.ini *'
    intel:
        parent_path: '*\cmd.exe'
        cmdline: +R +H +S +A \\*.cui
        Parentcmdline: C:\WINDOWS\system32\\*.bat
    condition: selection and not (ini or intel)
fields:
    - cmdline
    - Parentcmdline
    - owner_uid
tags:
    - attack.defense_evasion
    - attack.persistence
    - attack.t1158
falsepositives:
    - igfxCUIService.exe hiding *.cui files via .bat script (attrib.exe a child of cmd.exe and igfxCUIService.exe is the parent of the cmd.exe)
    - msiexec.exe hiding desktop.ini
level: low
