title: Execution in Non-Executable Folder
status: experimental
description: Detects a suspicious exection from an uncommon folder
author: Florian Roth
tags:
    - attack.defense_evasion
    - attack.t1036
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        path:
            - '*\$Recycle.bin'
            - '*\owner_uids\All owner_uids\\*'
            - '*\owner_uids\Default\\*'
            - '*\owner_uids\Public\\*'
            - 'C:\Perflogs\\*'
            - '*\config\systemprofile\\*'
            - '*\Windows\Fonts\\*'
            - '*\Windows\IME\\*'
            - '*\Windows\addins\\*'
    condition: selection
fields:
    - cmdline
    - Parentcmdline
falsepositives:
    - Unknown
level: high
