title: Processes created by MMC
status: experimental
description: Processes started by MMC could be a sign of lateral movement using MMC application COM object
references:
    - https://enigma0x3.net/2017/01/05/lateral-movement-using-the-mmc20-application-com-object/
tags:
    - attack.lateral_movement
    - attack.t1175
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        parent_path: '*\mmc.exe'
        path: '*\cmd.exe'
    exclusion:
        cmdline: '*\RunCmd.cmd'
    condition: selection and not exclusion
fields:
    - cmdline
    - Parentcmdline
falsepositives:
    - unknown
level: medium
