title: Scheduled Task Creation
status: experimental
description: Detects the creation of scheduled tasks in user session
author: Florian Roth
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        path: '*\schtasks.exe'
        cmdline: '* /create *'
    filter:
        owner_uid: NT AUTHORITY\SYSTEM
    condition: selection and not filter
fields:
    - cmdline
    - Parentcmdline
tags:
    - attack.execution
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1053
    - attack.s0111
falsepositives:
    - Administrative activity
    - Software installation
level: low
