title: Cmdkey Cached Credentials Recon
status: experimental
description: Detects usage of cmdkey to look for cached credentials
references:
    - https://www.peew.pw/blog/2017/11/26/exploring-cmdkey-an-edge-case-for-privilege-escalation
    - https://technet.microsoft.com/en-us/library/cc754243(v=ws.11).aspx
author: jmallette
tags:
    - attack.credential_access
    - attack.t1003
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        path: '*\cmdkey.exe'
        cmdline: '* /list *'
    condition: selection
fields:
    - cmdline
    - Parentcmdline
    - owner_uid
falsepositives:
    - Legitimate administrative tasks.
level: low
