title: Taskmgr as Parent
status: experimental
description: Detects the creation of a process from Windows task manager
tags:
    - attack.defense_evasion
    - attack.t1036
author: Florian Roth
date: 2018/03/13
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        parent_path: '*\taskmgr.exe'
    filter:
        path:
            - resmon.exe
            - mmc.exe
    condition: selection and not filter
fields:
    - path
    - cmdline
    - Parentcmdline
falsepositives:
    - Administrative activity
level: low
