title: Suspicious Execution from Outlook
status: experimental
description: Detects EnableUnsafeClientMailRules used for Script Execution from Outlook
references:
    - https://github.com/sensepost/ruler
    - https://www.fireeye.com/blog/threat-research/2018/12/overruled-containing-a-potentially-destructive-adversary.html
tags:
    - attack.execution
    - attack.t1059
    - attack.t1202
author: PolyLogyx
date: 2018/12/27
logsource:
    category: process_creation
    product: win_plgx_extension
detection:
    clientMailRules:
        cmdline: '*EnableUnsafeClientMailRules*'
    outlookExec:
        parent_path: '*\outlook.exe'
        cmdline: \\\\*\\*.exe
    condition: clientMailRules or outlookExec
falsepositives:
    - unknown
level: high
