title: WSF/JSE/JS/VBA/VBE File Execution
status: experimental
description: Detects suspicious file execution by wscript and cscript
author: PolyLogyx
tags:
    - attack.execution
    - attack.t1064
logsource:
    category: process_creation
    product: win_plgx_extension
detection:
    selection:
        path:
            - '*\wscript.exe'
            - '*\cscript.exe'
        cmdline:
            - '*.jse'
            - '*.vbe'
            - '*.js'
            - '*.vba'
    condition: selection
falsepositives:
    - Will need to be tuned. I recommend adding the user profile path in cmdline if
        it is getting too noisy.
level: medium
