title: Execution in Non-Executable Folder
status: experimental
description: Detects a suspicious exection from an uncommon folder
author: PolyLogyx
tags:
    - attack.defense_evasion
    - attack.t1036
logsource:
    category: process_creation
    product: win_plgx_extension
detection:
    selection:
        path:
            - '*\$Recycle.bin'
            - '*\owner_uids\All owner_uids\\*'
            - '*\owner_uids\Default\\*'
            - '*\owner_uids\Public\\*'
            - C:\Perflogs\\*
            - '*\config\systemprofile\\*'
            - '*\Windows\Fonts\\*'
            - '*\Windows\IME\\*'
            - '*\Windows\addins\\*'
    condition: selection
falsepositives:
    - Unknown
level: high
