title: Taskmgr as LOCAL_SYSTEM
status: experimental
description: Detects the creation of taskmgr.exe process in context of LOCAL_SYSTEM
tags:
    - attack.defense_evasion
    - attack.t1036
author: PolyLogyx
date: 2018/03/18
logsource:
    category: process_creation
    product: win_plgx_extension
detection:
    selection:
        owner_uid: NT AUTHORITY\SYSTEM
        path: '*\taskmgr.exe'
    condition: selection
falsepositives:
    - Unkown
level: high
