title: WMI Persistence - Script Event Consumer
status: experimental
description: Detects WMI script event consumers
references:
    - https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
author: PolyLogyx
date: 2018/03/07
tags:
    - attack.execution
    - attack.persistence
    - attack.t1047
logsource:
    category: process_creation
    product: win_plgx_extension
detection:
    selection:
        path: C:\WINDOWS\system32\wbem\scrcons.exe
        parent_path: C:\Windows\System32\svchost.exe
    condition: selection
falsepositives:
    - Legitimate event consumers
level: high
