title: Suspicious Calculator Usage
description: Detects suspicious use of calc.exe with command line parameters or in
    a suspicious directory, which is likely caused by some PoC or detection evasion
status: experimental
references:
    - https://twitter.com/ItsReallyNick/status/1094080242686312448
author: PolyLogyx
date: 2019/02/09
tags:
    - attack.defense_evasion
    - attack.t1036
logsource:
    category: process_creation
    product: win_plgx_extension
detection:
    selection1:
        cmdline: '*\calc.exe *'
    selection2:
        path: '*\calc.exe'
    filter2:
        path: '*\Windows\Sys*'
    condition: selection1 or ( selection2 and not filter2 )
falsepositives:
    - Unknown
level: high
