title: MSHTA Spawning Windows Shell
status: experimental
description: Detects a Windows command line executable started from MSHTA.
references:
    - https://www.trustedsec.com/july-2015/malicious-htas/
author: PolyLogyx
logsource:
    category: process_creation
    product: win_plgx_extension
detection:
    selection:
        parent_path: '*\mshta.exe'
        path:
            - '*\cmd.exe'
            - '*\powershell.exe'
            - '*\wscript.exe'
            - '*\cscript.exe'
            - '*\sh.exe'
            - '*\bash.exe'
            - '*\reg.exe'
            - '*\regsvr32.exe'
            - '*\BITSADMIN*'
    filter:
        cmdline:
            - '*/HP/HP*'
            - '*\HP\HP*'
    condition: selection and not filter
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1170
falsepositives:
    - Printer software / driver installations
level: high
