title: MSHTA spwaned by SVCHOST as seen in LethalHTA
status: experimental
description: Detects MSHTA.EXE spwaned by SVCHOST described in report
references:
    - https://codewhitesec.blogspot.com/2018/07/lethalhta.html
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1170
author: PolyLogyx
date: 2018/06/07
logsource:
    category: process_creation
    product: win_plgx_extension
detection:
    selection:
        parent_path: '*\svchost.exe'
        path: '*\mshta.exe'
    condition: selection
falsepositives:
    - Unknown
level: high
